#include <stdio.h>


//int main()
//{
//	int a = 10;//左移操作符 
//	int b = a >> 5;//把a 的二进制位向左移动一位 数值变大
//	printf("%d",b); // 最多移动31位
//	return 0;
//}
//int main()
//{
//	int a = 3;
//	int b = 1;
//	int c = a & b;//按位与  对应32进制位如果是有0则为0 都是1才是1
//	printf("%d", c);
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a | b;//按位或  对应32进制位如果是有1则为1 都是0才是0
//	printf("%d", c);
//}
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a ^ b;//按位异或  对应32进制位相同为0 相异为1
//	printf("%d", c);
//}
//int main()
//{
//	int a = -5;
//	int b = ~a;//按位取反  二进制位
//	printf("%d", b);
//}
//都必须是整数  
//int main()
//{
//	int d = 9999;
//	int count = 0;
//	while (d > 1)
//	{
//		d = d & (d - 1); count++;
//	}
//	printf("%d", count);
//}
int main()
{
	char a = 5; // 00000101     00000000000000000000000000000101  1 2 4 8 16 32 64 128
	char b = 120;//01111000     00000000000000000000000001111000
	char c = a + b; //			00000000000000000000000001111101
	printf("%d", c); //01111101 00000000000000000000000001111101 补码
							//  00000000000000000000000001111100 反码
							//  11111111111111111111111110000011 原码
}